/* Map (or Dictionary)
это такая структура данных, которая хранит пары ключ-значение.
При этом одному ключу соответствует ровно одно значение. 
Ключи индивидуальны. 
При этом различным ключам могут соответствовать одинаковые значения. */

public class App {
    public static void main(String[] args) {

        // hash - это отображение проекта на int

        /*
         * Object.hashCode контракт:
         * 1. hashCode всегда должен выдавать одно и то же значение в течение всей жихни
         * объекта
         * 2. Если o1.equals(o2), то хэшкоды этих объектов должны совпадать
         * 3. Вообще говоря, необязательно, чтобы различные объекты всегда выдавали
         * различные хэшкоды. Хэшкоды различных объектов могут быть равны
         */
    }
}
